app/controllers/admin/boards_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = 3 LIMIT 1
---
  def edit
    @board = Board.find(params[:id])

INSERT INTO "boards" ("name", "created_at", "updated_at") VALUES ('Board03', '2011-11-28 08:25:54.644237', '2011-11-28 08:25:54.644237')
---
  def create
    @board = Board.new(params[:board])

    respond_to do |format|
      if @board.save

SELECT "boards".* FROM "boards" WHERE "boards"."id" = 5 LIMIT 1
UPDATE "boards" SET "name" = 'Board0303', "updated_at" = '2011-11-28 08:26:25.663586' WHERE "boards"."id" = 5
---
  def update
    @board = Board.find(params[:id])

    respond_to do |format|
      if @board.update_attributes(params[:board])

SELECT "boards".* FROM "boards" WHERE "boards"."id" = 1 LIMIT 1
DELETE FROM "boards" WHERE "boards"."id" = 1
---
  def destroy
    @board = Board.find(params[:id])
    @board.destroy