app/controllers/admin/posts_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = 1 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 AND ("posts".user_id = 1) LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = 1
---
  def destroy
    @board = Board.find(params[:board_id])
    @post = current_user.posts.find(params[:id])

    @post.destroy