app/controllers/boards_controller.rb

SELECT "posts".* FROM "posts" WHERE ("posts".board_id = 1)
---
  def show
    @board = Board.find(params[:id])

    @posts = @board.posts.recent.paginate(:page => params[:page], :per_page => 5 )