app/controllers/boards_controller.rb

  def show
    @board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 1 LIMIT 1

  def edit
    @board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 2 LIMIT 1

  def create
    @board = Board.new(params[:board])

    respond_to do |format|
      if @board.save
---
INSERT INTO "boards" ("name", "created_at", "updated_at") VALUES ('1', '2011-11-24 06:12:44.805698', '2011-11-24 06:12:44.805698')

  def update
    @board = Board.find(params[:id])

    respond_to do |format|
      if @board.update_attributes(params[:board])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 1 LIMIT 1
UPDATE "boards" SET "name" = 'Board01Board01', "updated_at" = '2011-11-25 05:32:32.747123' WHERE "boards"."id" = 1

  def destroy
    @board = Board.find(params[:id])
    @board.destroy
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 1 LIMIT 1
DELETE FROM "boards" WHERE "boards"."id" = 1