app/controllers/posts_controller.rb

  def index
    @board = Board.find(params[:board_id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 1 LIMIT 1

  def show
    @board = Board.find(params[:board_id])
    @post = @board.posts.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 3 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 AND ("posts".board_id = 2) LIMIT 1

  def new
    @board = Board.find(params[:board_id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 2 LIMIT 1

  def edit
    @board = Board.find(params[:board_id])
    @post = current_user.posts.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 1 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 AND ("posts".board_id = 1) LIMIT 1

  def create
    @board = Board.find(params[:board_id])
    @post = @board.posts.build(params[:post])

    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 2 LIMIT 1
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "bord_id", "board_id", "user_id") VALUES ('Post01', 'Text01', '2011-11-25 08:28:23.578982', '2011-11-25 08:28:23.578982', NULL, 3, 1)

  def update
    @board = Board.find(params[:board_id])
    @post = current_user.posts.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 1 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 AND ("posts".board_id = 1) LIMIT 1
UPDATE "posts" SET "content" = 'Text01Text01', "updated_at" = '2011-11-25 05:29:37.019069' WHERE "posts"."id" = 1

  def destroy
    @board = Board.find(params[:board_id])
    @post = current_user.posts.find(params[:id])

    @post.destroy
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 4 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 AND ("posts".board_id = 2) LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = 1